Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ0512EFF064.PIC
      <edc:SFRDef edc:_addr="0x1F8016A4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01423_RPORx.Module" edc:_refcount="34" edc:access="----------------------------nnnn" edc:cname="RPG9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG9R" edc:desc="" edc:mask="0xf" edc:name="RPG9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f810000" edc:endaddr="0x1f812000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1_fast">
      <edc:SFRDef edc:_addr="0x1F810000" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="wwwwwwww---------n-n-nnn---nnnnn" edc:cname="INTCON" edc:desc="" edc:impl="0xff00571f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---------x-0-000---00000" edc:name="INTCON" edc:nzwidth="32" edc:por="xxxxxxxx---------x-0-000---00000" edc:portals="CLR SET INV" ltx:baseofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TPC" edc:desc="" edc:mask="0x7" edc:name="TPC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MVEC" edc:desc="" edc:mask="0x1" edc:name="MVEC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="NMIKEY" edc:mask="0xff" edc:name="NMIKEY" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INTERRUPT CONTROL" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810010" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn---n" edc:cname="PRISS" edc:desc="" edc:impl="0xfffffff1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000---0" edc:name="PRISS" edc:nzwidth="32" edc:por="0000000000000000000000000000---0" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS0" edc:desc="" edc:mask="0x1" edc:name="SS0" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI1SS" edc:desc="" edc:mask="0xf" edc:name="PRI1SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI2SS" edc:desc="" edc:mask="0xf" edc:name="PRI2SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI3SS" edc:desc="" edc:mask="0xf" edc:name="PRI3SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI4SS" edc:desc="" edc:mask="0xf" edc:name="PRI4SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI5SS" edc:desc="" edc:mask="0xf" edc:name="PRI5SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI6SS" edc:desc="" edc:mask="0xf" edc:name="PRI6SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI7SS" edc:desc="" edc:mask="0xf" edc:name="PRI7SS" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810020" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="---------------------rrrrrrrrrrr" edc:cname="INTSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="INTSTAT" edc:nzwidth="32" edc:por="---------------------00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIRQ" edc:desc="" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SRIPL" edc:desc="" edc:mask="0x7" edc:name="SRIPL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810030" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACD_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
